[{"name": "Nobody", "priority": 5, "season_watched": 0, "type": 2, "imdb_id": "tt7888964", "service": "HBO Max", "image": "https://imdb-api.com/images/original/MV5BMjM5YTRlZmUtZGVmYi00ZjE2LWIyNzAtOWVhMDk1MDdkYzhjXkEyXkFqcGdeQXVyMjMxOTE0ODA@._V1_Ratio0.6751_AL_.jpg", "plot": "Emmy winner Bob Odenkirk (Better Call Saul, The Post, Nebraska) stars as Hutch Mansell, an underestimated and overlooked dad and husband, taking life's indignities on the chin and never pushing back. A nobody. When two thieves break into his suburban home one night, Hutch declines to defend himself or his family, hoping to prevent serious violence. His teenage son, Blake (Gage Munroe, The Shack), is disappointed in him and his wife, Becca (Connie Nielsen, Wonder Woman), seems to pull only further away. The aftermath of the incident strikes a match to Hutch's long-simmering rage, triggering dormant instincts and propelling him on a brutal path that will surface dark secrets and lethal skills. In a barrage of fists, gunfire and squealing tires, Hutch must save his family from a dangerous adversary (famed Russian actor Aleksey Serebryakov, Amazon's McMafia)-and ensure that he will never be underestimated as a nobody again.", "year": "2021"}, {"name": "The Baby Sitter - Killer Queen", "priority": 4, "season_watched": 0, "type": 2, "imdb_id": "tt11024272", "service": "Netflix", "image": "https://imdb-api.com/images/original/MV5BMWEwMDU3MWUtZTdiMy00Yjg5LWFiNWYtYTRmZGExNzk5YjQ2XkEyXkFqcGdeQXVyNTUwOTkzMzY@._V1_Ratio0.6751_AL_.jpg", "plot": "Two years after Cole survived a satanic blood cult, he's living another nightmare: high school. And the demons from his past? Still making his life hell.", "year": "2020"}, {"name": "tick, tick... Boom!", "priority": 3, "season_watched": 0, "type": 2, "imdb_id": "tt8721424", "service": "Netflix", "image": "https://imdb-api.com/images/original/MV5BZmMyMmE0M2UtN2E2MC00YzVmLTkwODgtOTVhYjVlOTBhY2RjXkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_Ratio0.6751_AL_.jpg", "plot": "The film follows Jon (Andrew Garfield), a young theater composer who's waiting tables at a New York City diner in 1990 while writing what he hopes will be the next great American musical. Days before he's due to showcase his work in a make-or-break performance, Jon is feeling the pressure from everywhere: from his girlfriend Susan, who dreams of an artistic life beyond New York City; from his friend Michael, who has moved on from his dream to a life of financial security; amidst an artistic community being ravaged by the AIDS epidemic. With the clock ticking, Jon is at a crossroads and faces the question everyone must reckon with: What are we meant to do with the time we have?", "year": "2021"}, {"name": "King Richard", "priority": 2, "season_watched": 0, "type": 2, "imdb_id": "tt9620288", "service": "HBO Max", "image": "https://imdb-api.com/images/original/MV5BYTcyNmY4ZGEtYmE4Zi00ZDViLTlmYzMtMmQ4ZTM4OWNmZjQxXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_Ratio0.6751_AL_.jpg", "plot": "Armed with a clear vision and a brazen 78-page plan, Richard Williams is determined to write his daughters, Venus and Serena, into history. Training on Compton, California's neglected tennis courts--rain or shine--the girls are shaped by their father's unyielding commitment and their mother's balanced perspective and keen intuition, defying the seemingly insurmountable odds and prevailing expectations laid before them. Based on the true story that will inspire the world, \"King Richard\" follows the uplifting journey of a family whose unwavering resolve and unconditional belief ultimately delivers two of the world's greatest sports legends.", "year": "2021"}]