[{"name": "The Flight Attendant", "imdb_id": "tt7569576", "seasons_watched": 1, "service": "HBO Max", "priority": 19, "type": 1, "image": "https://imdb-api.com/images/original/MV5BN2U5Y2NiMDgtNDg4NS00ZTU2LWFlMmQtMjA5YjBkNDg4NGQ5XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_Ratio0.6751_AL_.jpg", "plot": "Flight attendant Cassandra Bowden wakes in her hotel room in Bangkok, hungover from the night before and with a dead body lying next to her. Afraid to call the police, she continues her morning as if nothing happened, joining the other flight attendants and pilots traveling to the airport. In New York, she is met by FBI agents who question her about her recent layover in Bangkok. Still unable to piece the night together, she begins to wonder if she could be the killer.", "year": "2020-", "seasons": 2}, {"name": "The book of Boba Fett", "priority": 18, "season_watched": 0, "type": 1, "imdb_id": "tt13668894", "service": "Disney+", "image": "https://imdb-api.com/images/original/MV5BZjllZjE1MWEtYTJhZC00MWIyLTliMjEtYzM3ODc4YzQ2MjFlXkEyXkFqcGdeQXVyODIyOTEyMzY@._V1_Ratio0.6751_AL_.jpg", "plot": "The legendary bounty hunter Boba Fett navigates the underworld of the galaxy with mercenary Fennec Shand when they return to the sands of Tatooine to stake their claim on the territory formerly ruled by the deceased crime lord Jabba the Hutt.", "year": "2021-", "seasons": 1}, {"name": "Ms. Marvel", "priority": 17, "season_watched": 0, "type": 1, "imdb_id": "tt10857164", "service": "Disney+", "image": "https://imdb-api.com/images/original/MV5BYmRiMjZhOWItMDQwMi00ZmM1LTg3YzctODZhMzc3Nzk1NjU5XkEyXkFqcGdeQXVyMTM1MTE1NDMx._V1_Ratio0.6751_AL_.jpg", "plot": "New Jersey raised Kamala Khan learns she has polymorphous powers.", "year": "2022-", "seasons": 1}, {"name": "Moon Knight", "priority": 16, "season_watched": 0, "type": 1, "imdb_id": "tt10234724", "service": "Disney+", "image": "https://imdb-api.com/images/original/MV5BNGM2ZjJmZDQtNTI5MS00ZTI0LTkyNjktM2RlYWY0YTY5MTYzXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_Ratio0.6751_AL_.jpg", "plot": "The series follows Steven Grant, a mild- mannered gift-shop employee, who becomes plagued with blackouts and memories of another life. Steven discovers he has dissociative identity disorder and shares a body with mercenary Marc Spector. As Steven/Marc's enemies converge upon them, they must navigate their complex identities while thrust into a deadly mystery among the powerful gods of Egypt.", "year": "2022-", "seasons": 1}, {"name": "The Dropout", "priority": 15, "season_watched": 0, "type": 1, "imdb_id": "tt10166622", "service": "Hulu", "image": "https://imdb-api.com/images/original/MV5BOTEzYzYzOTgtNDVhMS00NTkxLWExNGEtOTU1MjhkZWZjYWZmXkEyXkFqcGdeQXVyMTM1MTE1NDMx._V1_Ratio0.6751_AL_.jpg", "plot": "TV series that chronicles Theranos founder Elizabeth Holmes' attempt to revolutionize the healthcare industry after dropping out of college and starting a technology company.", "year": "2022-", "seasons": 1}, {"name": "The Marvelous Mrs. Maisel", "priority": 14, "season_watched": 3, "type": 1, "imdb_id": "tt5788792", "service": "Amazon Prime", "image": "https://imdb-api.com/images/original/MV5BMzk2ZmFhNjMtOWM2YS00MGU4LTk3ODMtY2Q2MjU2ODA0MDg4XkEyXkFqcGdeQXVyODk4OTc3MTY@._V1_Ratio0.6751_AL_.jpg", "plot": "Set in 1950s Manhattan, The Marvelous Mrs. Maisel is a 60-minute dramedy that centers on Miriam \"Midge\" Maisel, a sunny, energetic, sharp Jewish woman who had her life mapped out: go to college, find a husband, have kids, and throw the best Yom Kippur breakfasts in town. Soon enough, she finds herself exactly where she had hoped to be, living happily with her husband and two children on the Upper West Side. A woman of her time, Midge is a cheerleader wife of a man who dreams of a stand-up comedy career, but her perfect life is upended when her husband suddenly leaves her for another woman. Utterly unprepared, Midge is left with no choice but to reevaluate her life. When she accidentally stumbles onto the stage at a nightclub, she discovers her own comedic skills and decides to use this newfound talent to help her reinvent her life. The series follows the trajectory of Midge's journey as she pursues a career in the male-dominated stand-up comedy profession, and it transforms from uptown society matron to East Village club performer.", "year": "2017-", "seasons": 4}, {"name": "The Expanse", "priority": 13, "season_watched": 5, "type": 1, "imdb_id": "tt3230854", "service": "Amazon Prime", "image": "https://imdb-api.com/images/original/MV5BZDVmMDljM2QtZDkzZC00ZDg2LWFiMGItZjNiNjliZjg2MGEzXkEyXkFqcGdeQXVyMjkwOTAyMDU@._V1_Ratio0.6751_AL_.jpg", "plot": "Two hundred years from now, the solar system's been colonized, and police detective, Josephus Miller's given the assignment of finding a missing woman. Meanwhile, an officer of an ice freighter sees what appears to be an unprovoked attack upon the ship, by a craft from Mars. As news of the attack spreads, the incident's repercussions threaten to destabilize an already tenuous relations between Earth, Mars and the asteroid belt.", "year": "2015-2022", "seasons": 6}, {"name": "Goliath", "priority": 12, "season_watched": 1, "type": 1, "imdb_id": "tt4687880", "service": "Amazon Prime", "image": "https://imdb-api.com/images/original/MV5BMWE5NGI2YzAtNzllYS00NmU3LWI2ZWItMmZkMDE3YWMyNWVmXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_Ratio0.6751_AL_.jpg", "plot": "Billy Mcbride is going through a rough patch. He has been fired from the law firm he helped build, his wife has left him, and he's now a down on his luck ambulance chaser. A lady (Patty) approaches him to represent her in a wrongful death case. After reluctantly accepting to take on the case, a series of strange events befall Billy. Through death threats, harassment, and trumped up arrests, Billy embarks on obtaining justice, and it is one hell of a ride. Additional unique cases eventually come Billy and Patty's way, making the ride even more entertaining.", "year": "2016-2021", "seasons": 4}, {"name": "Raised By Wolves", "priority": 11, "season_watched": 1, "type": 1, "imdb_id": "tt9170108", "service": "HBO Max", "image": "https://imdb-api.com/images/original/MV5BNzk0ZTZlOGItMjQ0MC00YzYyLWIwYjgtMGM4NDdkOTlhYzIzXkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_Ratio0.6751_AL_.jpg", "plot": "After Earth is torn apart by religious differences and the human race teeters on the edge of extinction, an atheistic android architect sends two creations - Mother and Father - to start a peaceful, godless colony on the planet Kepler-22b. From executive producer Ridley Scott, Raised by Wolves follows Mother and Father as they attempt to raise human children in this mysterious virgin land - a treacherous and difficult task that's jeopardized by the arrival of the Mithraic, a deeply devout religious order of surviving humans. As the androids make contact with this zealous and dangerous people, they struggle to control the beliefs of their fiercely self-determining children.", "year": "2020-", "seasons": 2}, {"name": "Fauda", "priority": 10, "season_watched": 1, "type": 1, "imdb_id": "tt4565380", "service": "Netflix", "image": "https://imdb-api.com/images/original/MV5BZTk5OTU5Y2EtY2M1NC00N2E5LWJlMTMtODgzMDc2NDk1MTczXkEyXkFqcGdeQXVyMjMyMzI4MzY@._V1_Ratio0.6751_AL_.jpg", "plot": "\"Fauda\" (Arabic for 'Chaos') depicts the two-sided story of the Israeli-Palestinian conflict. Doron, a commander of undercover Israeli unit, the Israeli Special Forces, operating inside Palestinian territories, and his team, are hunting down Hamas terrorist Abu-Ahmed. On the other side of the fence, the life of Abu-Ahmed and his family, who has thus far murdered 143 Israelis, will never accept the State of Israel, and will continue Jihad for as long as it takes.", "year": "2015-", "seasons": 4}, {"name": "Foundation", "priority": 9, "season_watched": 0, "type": 1, "imdb_id": "tt0804484", "service": "AppleTV+", "image": "https://imdb-api.com/images/original/MV5BMTE5MDY1MGUtMmMxNi00YjA3LWIyZTYtN2FhOWJmNTY2NmM4XkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_Ratio0.6751_AL_.jpg", "plot": "Far in the future, The Empire is about to face a reckoning unlike anything else it's faced before: several Millenia of chaos has been predicted by the galaxy's leading psycho-historian: Hari Seldon. But can The Empire offset the disaster before it begins?", "year": "2021-", "seasons": 0}, {"name": "Ted Lasso", "priority": 8, "season_watched": 0, "type": 1, "imdb_id": "tt10986410", "service": "AppleTV+", "image": "https://imdb-api.com/images/original/MV5BMDVmODUzNmEtMGMxZC00NWUzLTkxMTAtMDM5OTQzMWE0ZDM3XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_Ratio0.6751_AL_.jpg", "plot": "American college football coach Ted Lasso heads to London to manage AFC Richmond, a struggling English Premier League football team.", "year": "2020-", "seasons": 2}, {"name": "Ozark", "priority": 7, "season_watched": 3, "type": 1, "imdb_id": "tt5071412", "service": "Netflix", "image": "https://imdb-api.com/images/original/MV5BNGY3MmUzNjktZWEzNi00ODdiLTk4ZDItZjBhMjZlYzI0NTJjXkEyXkFqcGdeQXVyMTEyMjM2NDc2._V1_Ratio0.6751_AL_.jpg", "plot": "The Byrdes and their teenage kids, Charlotte and Jonah, are, for all intents and purposes, an ordinary family with ordinary lives. Except for the job of Marty, a Chicago financial advisor who also serves as the top money launderer for the second largest drug cartel in Mexico. When things go awry, Marty must uproot his family from the skyscrapers of Chicago and relocate to the lazy lake region of the Missouri Ozarks.", "year": "2017-2022", "seasons": 4}, {"name": "House of the Dragons", "priority": 5, "season_watched": 0, "type": 1, "imdb_id": "tt11198330", "service": "HBO Max", "image": "https://imdb-api.com/images/original/MV5BMTFmZjZjOWItOWY0NC00ZDA1LWFhN2ItMDI1ZGNmNGE2NGJmXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_Ratio0.6751_AL_.jpg", "plot": "The story of the House Targaryen set 200 years before the events of Game of Thrones (2011).", "year": "2022-", "seasons": 1}, {"name": "The Wheel of Time", "priority": 4, "season_watched": 1, "type": 1, "imdb_id": "tt7462410", "service": "Amazon Prime", "image": "https://imdb-api.com/images/original/MV5BYzA2Nzk5M2EtNWY4Yi00ZDY4LThkZTgtYjhhNWEyMGY0MjFjXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_Ratio0.6751_AL_.jpg", "plot": "Set in a high fantasy world where magic exists, but only some can access it, a woman named Moiraine crosses paths with five young men and women. This sparks a dangerous, world-spanning journey. Based on the book series by Robert Jordan.", "year": "2021-", "seasons": 2}]